<h1>3장 Pandas로 데이터 가공하기</h1>

<h2>누락된 데이터 처리하기</h2>

<b>누락된 데이터 처리 방식의 트레이드오프</b>

<b>Pandas에서 누락된 데이터</b>

<b>None: 파이썬의 누락된 데이터</b>

In [1]:
import numpy as np
import pandas as pd
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [2]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
dtype = int

dtype = object
68.5 ms ± 589 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
835 µs ± 8.31 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [3]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

<b>NaN:누락된 숫자 데이터</b>

In [8]:
vals2 = np.array([1, np.nan, 3, 4])
vals2

array([ 1., nan,  3.,  4.])

In [9]:
np.nan

nan

In [10]:
1 + np.nan

nan

In [11]:
0 * np.nan

nan

In [13]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [15]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

<b>Pandas에서 Nan과 Neno</b>

In [16]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [18]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

<table style="width:100%">
  <tr>
    <th>타입 클래스</th>
    <th>NA 값을 저장할 때의 변환</th> 
    <th>NA 센티널 값</th>
  </tr>
  <tr>
    <td>floating</td>
    <td>변경 없음</td> 
    <td>Np.nan</td>
  </tr>
  <tr>
    <td>object</td>
    <td>변경 없음</td> 
    <td>None 또는 np.nan</td>
  </tr>
  <tr>
    <td>interger</td>
    <td>float64</td> 
    <td>np.nan</td>
  </tr>
  <tr>
    <td>Boolean</td>
    <td>object로 변환</td> 
    <td>None 또는 np.nan</td>
  </tr>
</table>

<b>널 값 연산하기</b>

isnull() : 누락값을 가리키는 부울 마스크트를 생성 <br>
notnull() : isnull()의 역 <br>
dropna() : 데이터에 필터를 적용한 버전을 반환 <br>
fillna() : 누락값을 채우거나 전가된 데이터 사본을 반환

<b>널 값 탐지 </b>

In [21]:
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [25]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [24]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [26]:
data.dropna()

0        1
2    hello
dtype: object

In [36]:
df = pd.DataFrame([[1, np.nan, 2], 
                    [2, 3, 5],
                  [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [37]:
df.dropna() # 전체 행이나 전체 열을 삭제하는 것만 가능

     0    1  2
1  2.0  3.0  5

In [39]:
df.dropna(axis='columns') # NA값을 포함한 열을 삭제

   2
0  2
1  5
2  6

In [40]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [42]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [43]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

<b>널 값 채우기</b>

In [46]:
data = pd.Series([1, np.nan, 2, None, 3], index = list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [47]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [49]:
# forward-fill(이전 값으로 채우기)
data.fillna(method = 'ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [50]:
# back-fill(다음 값으로 채우기)
data.fillna(method = 'bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [51]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [52]:
df.fillna(method='ffill', axis = 1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0